<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>ODSsearch - Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="cz" class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>ODSsearch - Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va</h1></div><div><div class="author"><h3 class="author">Karol&iacute;na Bo&#382;kov&aacute;</h3><code class="email">&lt;<a class="email" href="mailto:422243@mail.muni.cz">422243@mail.muni.cz</a>&gt;</code></div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#d5e7">&Uacute;vod</a></span></dt><dt><span class="section"><a href="#d5e10">&#344;e&#353;en&iacute;</a></span></dt><dt><span class="section"><a href="#d5e17">Z&aacute;v&#283;r</a></span></dt></dl></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e7"></a>&Uacute;vod</h2></div></div></div><p>Zad&aacute;n&iacute;m bylo vytvo&#345;it jednoduchou webovou aplikaci, kter&aacute; bude prohled&aacute;vat 
            p&#345;edlo&#382;en&yacute; Open Document Spreadsheet soubor (*.ods) pro dan&yacute; v&yacute;raz a na v&yacute;stup 
            vypsat pro ka&#382;d&yacute; list v&#353;echny &#345;&aacute;dky, je&#382; hledan&yacute; v&yacute;raz obsahuj&iacute;.</p></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e10"></a>&#344;e&#353;en&iacute;</h2></div></div></div><p>M&yacute;m &uacute;kolem bylo pro aplikaci naprogramovat a zdokumentovat backend. Ten se 
            skl&aacute;d&aacute; hlavn&#283; ze dvou t&#345;&iacute;d - SearchInSpreadSheet a Result. </p><p>T&#345;&iacute;da SearchInSpreadSheet prohled&aacute;v&aacute; v&#353;echny listy poskytnut&eacute;ho dokumentu pro
            hledan&yacute; v&yacute;raz. Je mo&#382;n&eacute; nastavit, zda hled&aacute;n&iacute; m&aacute; &#269;i nem&aacute; rozli&#353;ovat
            velikost p&iacute;smen. </p><p>T&#345;&iacute;da Result p&#345;edstavuje nalezen&eacute; &#345;&aacute;dky v jednom listu dokumentu. 
            Obsahuje n&aacute;zev listu, hlavi&#269;ku tabulky a &#345;&aacute;dky obsahuj&iacute;c&iacute; hledan&yacute; v&yacute;raz. </p><p>Pro manipulaci s dokumentem jsem pou&#382;ila knihovnu jOpenDocument.</p><p>Jako sou&#269;&aacute;st backendu jsem tak&eacute; naprogramovala jednoduch&eacute; konzolov&eacute; rozhran&iacute;, 
            realizovan&eacute; t&#345;&iacute;dou Main. P&#345;i v&yacute;voji  bylo u&#382;ite&#269;n&eacute; hlavn&#283; pro kontrolu 
            chov&aacute;n&iacute; backendu v dob&#283; kdy nebylo k dispozici rozhran&iacute; webov&eacute; a ani testy.</p></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e17"></a>Z&aacute;v&#283;r</h2></div></div></div><p>O celkov&eacute;m chov&aacute;n&iacute; aplikace jsme rozhodovali v podstat&#283; kolektivn&#283;. 
            Ka&#382;d&yacute; &#269;len t&yacute;mu m&#283;l p&#345;id&#283;lenou vlastn&iacute; &#269;&aacute;st projektu za kterou zodpov&iacute;dal 
            a kterou tak mohl d&#283;lat nez&aacute;visle na ostatn&iacute;ch.</p></div></div></body></html>