<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>ODSsearch - Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="cz" class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>ODSsearch - Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va</h1></div><div><div class="author"><h3 class="author">Karel Tesa&#345;</h3><code class="email">&lt;<a class="email" href="mailto:235905@mail.muni.cz">235905@mail.muni.cz</a>&gt;</code></div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#d5e7">&Uacute;vod</a></span></dt><dt><span class="section"><a href="#d5e10">&#344;e&#353;en&iacute;</a></span></dt><dt><span class="section"><a href="#d5e18">Z&aacute;v&#283;r</a></span></dt></dl></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e7"></a>&Uacute;vod</h2></div></div></div><p>Zad&aacute;n&iacute;m bylo vytvo&#345;it jednoduchou webovou aplikaci, kter&aacute; bude prohled&aacute;vat 
            p&#345;edlo&#382;en&yacute; Open Document Spreadsheet soubor (*.ods) pro dan&yacute; v&yacute;raz a na v&yacute;stup 
            vypsat pro ka&#382;d&yacute; list v&#353;echny &#345;&aacute;dky, je&#382; hledan&yacute; v&yacute;raz obsahuj&iacute;.</p></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e10"></a>&#344;e&#353;en&iacute;</h2></div></div></div><p>V r&aacute;mci t&yacute;mov&eacute; pr&aacute;ce jsem m&#283;l na starosti zejm&eacute;na vytvo&#345;en&iacute; frontendu webov&eacute; aplikace.
            Pro tyto &uacute;&#269;ely jsem zvolil vyu&#382;it&iacute; javov&eacute;ho frameworku Spring Boot, kter&yacute; je zalo&#382;en&yacute; na
            Spring MVC. </p><p>Webov&aacute; aplikace jako takov&aacute; je vystav&#283;n&aacute; na html &#353;ablon&#283;, kterou jsem designov&#283; navrhl
            a postupn&#283; dle p&#345;ipom&iacute;nek koleg&#367; upravoval tak, aby v&yacute;sledn&yacute; vzhled a funkcionalita
            spl&#328;ovala na&#353;e po&#382;adavky a n&aacute;roky. </p><p>Pro stylizaci jsem vyu&#382;il dnes velmi hojn&#283; pou&#382;&iacute;van&eacute;ho javascriptov&eacute;ho frameworku
            Bootstrap. Vytvo&#345;il jsem velice jednoduch&yacute; webov&yacute; formul&aacute;&#345;. Tento formul&aacute;&#345; m&aacute; za &uacute;kol
            u&#382;ivateli umo&#382;nit zadat v&yacute;raz, kter&yacute; chce hledat, soubor ve kter&eacute;m vyhled&aacute;vat a
            podm&iacute;nku, zda-li hledat s ohledem na velikost p&iacute;smen.</p><p>Z&iacute;skan&eacute; informace z formul&aacute;&#345;e p&#345;ed&aacute;v&aacute; frontend ve stanoven&eacute;m form&aacute;tu ke zpracov&aacute;n&iacute;
            backendu, od kter&eacute;ho n&aacute;sledn&#283; z&iacute;sk&aacute;v&aacute; odezvu (v&yacute;sledek) a tuto dle mo&#382;nost&iacute; op&#283;t pomoc&iacute;
            stejn&eacute; html &#353;ablony u&#382;ivateli zobraz&iacute;.</p><p>T&yacute;mov&#283; jsme &#345;e&#353;ili jak&yacute; zvolit vhodn&yacute; design a jak zobrazit validn&iacute; v&yacute;stupy, ale t&eacute;&#382;
            jsme museli vy&#345;e&#353;it jakou vhodnou formou zobrazit u&#382;ivateli nastal&eacute; vyj&iacute;mky. V&#283;&#345;&iacute;m, &#382;e
            se n&aacute;m poda&#345;ilo dostate&#269;n&#283; p&#345;ehledn&#283; zobrazit v&#353;e, co u&#382;ivatel od aplikace
            po&#382;aduje.</p><p>Krom&#283; programov&aacute;n&iacute; frontendu jsem s kolegy spolupracoval i na prvotn&iacute; verzi wiki
            str&aacute;nek a na spole&#269;n&eacute; prezentaci.</p></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e18"></a>Z&aacute;v&#283;r</h2></div></div></div><p>Projekt byl rozhodn&#283; zaj&iacute;mav&yacute;m zpest&#345;en&iacute;m p&#345;i studiu, kdy v&#283;t&#353;inou v p&#345;edm&#283;tech
            pracujeme pouze jako jednotlivci. M&aacute;m r&aacute;d t&yacute;movou pr&aacute;ci a jsem p&#345;esv&#283;d&#269;en, &#382;e jsme
            spole&#269;n&#283; vytvo&#345;ili funk&#269;n&iacute; webovou aplikaci, kter&aacute; spl&#328;uje n&aacute;roky zad&aacute;n&iacute;. Jako nejv&#283;t&#353;&iacute;
            osobn&iacute; p&#345;&iacute;nos pak fakt, &#382;e jsem se p&#345;i tomto projektu poprv&eacute; bl&iacute;&#382;e sezn&aacute;mil s vyu&#382;it&iacute;m
            verzovac&iacute;ho syst&eacute;mu GitHub.</p></div></div></body></html>
